sownlee/MCAL/env/STM32F407VG/header/Header_ADC.h
#if !defined(HEADER_ADC_H_)  
#define HEADER_ADC_H_

#include "Header.h"

typedef struct
{
  __IO uint32_t SR;     /* ADC status register,                          */
  __IO uint32_t CR1;    /* ADC control register 1,                       */
  __IO uint32_t CR2;    /* ADC control register 2,                       */
  __IO uint32_t SMPR1;  /* ADC sample time register 1,                   */
  __IO uint32_t SMPR2;  /* ADC sample time register 2,                   */
  __IO uint32_t JOFR1;  /* ADC injected channel data offset register 1,  */
  __IO uint32_t JOFR2;  /* ADC injected channel data offset register 2,  */
  __IO uint32_t JOFR3;  /* ADC injected channel data offset register 3,  */
  __IO uint32_t JOFR4;  /* ADC injected channel data offset register 4,  */
  __IO uint32_t HTR;    /* ADC watchdog higher threshold register,       */
  __IO uint32_t LTR;    /* ADC watchdog lower threshold register,        */
  __IO uint32_t SQR1;   /* ADC regular sequence register 1,              */
  __IO uint32_t SQR2;   /* ADC regular sequence register 2,              */
  __IO uint32_t SQR3;   /* ADC regular sequence register 3,              */
  __IO uint32_t JSQR;   /* ADC injected sequence register,              */
  __IO uint32_t JDR1;   /* ADC injected data register 1,                 */
  __IO uint32_t JDR2;   /* ADC injected data register 2,                 */
  __IO uint32_t JDR3;   /* ADC injected data register 3,                 */
  __IO uint32_t JDR4;   /* ADC injected data register 4,                 */
  __IO uint32_t DR;     /* ADC regular data register,                    */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CSR;    /* ADC Common status register,                   */
  __IO uint32_t CCR;    /* ADC common control register,                  */
  __IO uint32_t CDR;    /* ADC common regular data register for dual AND triple modes  */
} ADC_Common_TypeDef;

#define ADC1                ((ADC_TypeDef *) ADC1_BASEADDR)
#define ADC2                ((ADC_TypeDef *) ADC2_BASEADDR)
#define ADC3                ((ADC_TypeDef *) ADC3_BASEADDR)
#define ADC123_COMMON       ((ADC_Common_TypeDef *) ADC123_COMMON_BASE)

/********************  Bit definition for ADC_SR register  ********************/
#define ADC_SR_AWD_Pos            (0U)                                         
#define ADC_SR_AWD_Msk            (0x1UL << ADC_SR_AWD_Pos)                     
#define ADC_SR_AWD                ADC_SR_AWD_Msk                             
#define ADC_SR_EOC_Pos            (1U)                                       
#define ADC_SR_EOC_Msk            (0x1UL << ADC_SR_EOC_Pos)                  
#define ADC_SR_EOC                ADC_SR_EOC_Msk                             
#define ADC_SR_JEOC_Pos           (2U)                                       
#define ADC_SR_JEOC_Msk           (0x1UL << ADC_SR_JEOC_Pos)                 
#define ADC_SR_JEOC               ADC_SR_JEOC_Msk                            
#define ADC_SR_JSTRT_Pos          (3U)                                       
#define ADC_SR_JSTRT_Msk          (0x1UL << ADC_SR_JSTRT_Pos)                
#define ADC_SR_JSTRT              ADC_SR_JSTRT_Msk                           
#define ADC_SR_STRT_Pos           (4U)                                       
#define ADC_SR_STRT_Msk           (0x1UL << ADC_SR_STRT_Pos)                 
#define ADC_SR_STRT               ADC_SR_STRT_Msk                            
#define ADC_SR_OVR_Pos            (5U)                                       
#define ADC_SR_OVR_Msk            (0x1UL << ADC_SR_OVR_Pos)                  
#define ADC_SR_OVR                ADC_SR_OVR_Msk                             

/*******************  Bit definition for ADC_CR1 register  ********************/
#define ADC_CR1_AWDCH_Pos         (0U)                                         
#define ADC_CR1_AWDCH_Msk         (0x1FUL << ADC_CR1_AWDCH_Pos)                 
#define ADC_CR1_AWDCH             ADC_CR1_AWDCH_Msk                            
#define ADC_CR1_AWDCH_0           (0x01UL << ADC_CR1_AWDCH_Pos)                 
#define ADC_CR1_AWDCH_1           (0x02UL << ADC_CR1_AWDCH_Pos)                 
#define ADC_CR1_AWDCH_2           (0x04UL << ADC_CR1_AWDCH_Pos)                 
#define ADC_CR1_AWDCH_3           (0x08UL << ADC_CR1_AWDCH_Pos)                 
#define ADC_CR1_AWDCH_4           (0x10UL << ADC_CR1_AWDCH_Pos)                 
#define ADC_CR1_EOCIE_Pos         (5U)                                         
#define ADC_CR1_EOCIE_Msk         (0x1UL << ADC_CR1_EOCIE_Pos)                  
#define ADC_CR1_EOCIE             ADC_CR1_EOCIE_Msk                          
#define ADC_CR1_AWDIE_Pos         (6U)                                       
#define ADC_CR1_AWDIE_Msk         (0x1UL << ADC_CR1_AWDIE_Pos)               
#define ADC_CR1_AWDIE             ADC_CR1_AWDIE_Msk                          
#define ADC_CR1_JEOCIE_Pos        (7U)                                       
#define ADC_CR1_JEOCIE_Msk        (0x1UL << ADC_CR1_JEOCIE_Pos)              
#define ADC_CR1_JEOCIE            ADC_CR1_JEOCIE_Msk                         
#define ADC_CR1_SCAN_Pos          (8U)                                       
#define ADC_CR1_SCAN_Msk          (0x1UL << ADC_CR1_SCAN_Pos)                
#define ADC_CR1_SCAN              ADC_CR1_SCAN_Msk                           
#define ADC_CR1_AWDSGL_Pos        (9U)                                       
#define ADC_CR1_AWDSGL_Msk        (0x1UL << ADC_CR1_AWDSGL_Pos)              
#define ADC_CR1_AWDSGL            ADC_CR1_AWDSGL_Msk                         
#define ADC_CR1_JAUTO_Pos         (10U)                                      
#define ADC_CR1_JAUTO_Msk         (0x1UL << ADC_CR1_JAUTO_Pos)               
#define ADC_CR1_JAUTO             ADC_CR1_JAUTO_Msk                          
#define ADC_CR1_DISCEN_Pos        (11U)                                      
#define ADC_CR1_DISCEN_Msk        (0x1UL << ADC_CR1_DISCEN_Pos)              
#define ADC_CR1_DISCEN            ADC_CR1_DISCEN_Msk                         
#define ADC_CR1_JDISCEN_Pos       (12U)                                      
#define ADC_CR1_JDISCEN_Msk       (0x1UL << ADC_CR1_JDISCEN_Pos)             
#define ADC_CR1_JDISCEN           ADC_CR1_JDISCEN_Msk                        
#define ADC_CR1_DISCNUM_Pos       (13U)                                      
#define ADC_CR1_DISCNUM_Msk       (0x7UL << ADC_CR1_DISCNUM_Pos)             
#define ADC_CR1_DISCNUM           ADC_CR1_DISCNUM_Msk                        
#define ADC_CR1_DISCNUM_0         (0x1UL << ADC_CR1_DISCNUM_Pos)             
#define ADC_CR1_DISCNUM_1         (0x2UL << ADC_CR1_DISCNUM_Pos)             
#define ADC_CR1_DISCNUM_2         (0x4UL << ADC_CR1_DISCNUM_Pos)             
#define ADC_CR1_JAWDEN_Pos        (22U)                                      
#define ADC_CR1_JAWDEN_Msk        (0x1UL << ADC_CR1_JAWDEN_Pos)              
#define ADC_CR1_JAWDEN            ADC_CR1_JAWDEN_Msk                         
#define ADC_CR1_AWDEN_Pos         (23U)                                      
#define ADC_CR1_AWDEN_Msk         (0x1UL << ADC_CR1_AWDEN_Pos)               
#define ADC_CR1_AWDEN             ADC_CR1_AWDEN_Msk                          
#define ADC_CR1_RES_Pos           (24U)                                      
#define ADC_CR1_RES_Msk           (0x3UL << ADC_CR1_RES_Pos)                 
#define ADC_CR1_RES               ADC_CR1_RES_Msk                            
#define ADC_CR1_RES_0             (0x1UL << ADC_CR1_RES_Pos)                 
#define ADC_CR1_RES_1             (0x2UL << ADC_CR1_RES_Pos)                 
#define ADC_CR1_OVRIE_Pos         (26U)                                      
#define ADC_CR1_OVRIE_Msk         (0x1UL << ADC_CR1_OVRIE_Pos)               
#define ADC_CR1_OVRIE             ADC_CR1_OVRIE_Msk                          
  
/*******************  Bit definition for ADC_CR2 register  ********************/
#define ADC_CR2_ADON_Pos          (0U)                                         
#define ADC_CR2_ADON_Msk          (0x1UL << ADC_CR2_ADON_Pos)                   
#define ADC_CR2_ADON              ADC_CR2_ADON_Msk                           
#define ADC_CR2_CONT_Pos          (1U)                                       
#define ADC_CR2_CONT_Msk          (0x1UL << ADC_CR2_CONT_Pos)                
#define ADC_CR2_CONT              ADC_CR2_CONT_Msk                           
#define ADC_CR2_DMA_Pos           (8U)                                       
#define ADC_CR2_DMA_Msk           (0x1UL << ADC_CR2_DMA_Pos)                 
#define ADC_CR2_DMA               ADC_CR2_DMA_Msk                            
#define ADC_CR2_DDS_Pos           (9U)                                       
#define ADC_CR2_DDS_Msk           (0x1UL << ADC_CR2_DDS_Pos)                 
#define ADC_CR2_DDS               ADC_CR2_DDS_Msk                            
#define ADC_CR2_EOCS_Pos          (10U)                                      
#define ADC_CR2_EOCS_Msk          (0x1UL << ADC_CR2_EOCS_Pos)                
#define ADC_CR2_EOCS              ADC_CR2_EOCS_Msk                           
#define ADC_CR2_ALIGN_Pos         (11U)                                      
#define ADC_CR2_ALIGN_Msk         (0x1UL << ADC_CR2_ALIGN_Pos)               
#define ADC_CR2_ALIGN             ADC_CR2_ALIGN_Msk                          
#define ADC_CR2_JEXTSEL_Pos       (16U)                                      
#define ADC_CR2_JEXTSEL_Msk       (0xFUL << ADC_CR2_JEXTSEL_Pos)             
#define ADC_CR2_JEXTSEL           ADC_CR2_JEXTSEL_Msk                        
#define ADC_CR2_JEXTSEL_0         (0x1UL << ADC_CR2_JEXTSEL_Pos)             
#define ADC_CR2_JEXTSEL_1         (0x2UL << ADC_CR2_JEXTSEL_Pos)             
#define ADC_CR2_JEXTSEL_2         (0x4UL << ADC_CR2_JEXTSEL_Pos)             
#define ADC_CR2_JEXTSEL_3         (0x8UL << ADC_CR2_JEXTSEL_Pos)             
#define ADC_CR2_JEXTEN_Pos        (20U)                                      
#define ADC_CR2_JEXTEN_Msk        (0x3UL << ADC_CR2_JEXTEN_Pos)              
#define ADC_CR2_JEXTEN            ADC_CR2_JEXTEN_Msk                         
#define ADC_CR2_JEXTEN_0          (0x1UL << ADC_CR2_JEXTEN_Pos)              
#define ADC_CR2_JEXTEN_1          (0x2UL << ADC_CR2_JEXTEN_Pos)              
#define ADC_CR2_JSWSTART_Pos      (22U)                                      
#define ADC_CR2_JSWSTART_Msk      (0x1UL << ADC_CR2_JSWSTART_Pos)            
#define ADC_CR2_JSWSTART          ADC_CR2_JSWSTART_Msk                       
#define ADC_CR2_EXTSEL_Pos        (24U)                                      
#define ADC_CR2_EXTSEL_Msk        (0xFUL << ADC_CR2_EXTSEL_Pos)              
#define ADC_CR2_EXTSEL            ADC_CR2_EXTSEL_Msk                         
#define ADC_CR2_EXTSEL_0          (0x1UL << ADC_CR2_EXTSEL_Pos)              
#define ADC_CR2_EXTSEL_1          (0x2UL << ADC_CR2_EXTSEL_Pos)              
#define ADC_CR2_EXTSEL_2          (0x4UL << ADC_CR2_EXTSEL_Pos)              
#define ADC_CR2_EXTSEL_3          (0x8UL << ADC_CR2_EXTSEL_Pos)              
#define ADC_CR2_EXTEN_Pos         (28U)                                      
#define ADC_CR2_EXTEN_Msk         (0x3UL << ADC_CR2_EXTEN_Pos)               
#define ADC_CR2_EXTEN             ADC_CR2_EXTEN_Msk                          
#define ADC_CR2_EXTEN_0           (0x1UL << ADC_CR2_EXTEN_Pos)               
#define ADC_CR2_EXTEN_1           (0x2UL << ADC_CR2_EXTEN_Pos)               
#define ADC_CR2_SWSTART_Pos       (30U)                                      
#define ADC_CR2_SWSTART_Msk       (0x1UL << ADC_CR2_SWSTART_Pos)             
#define ADC_CR2_SWSTART           ADC_CR2_SWSTART_Msk                        

/******************  Bit definition for ADC_SMPR1 register  *******************/
#define ADC_SMPR1_SMP10_Pos       (0U)                                         
#define ADC_SMPR1_SMP10_Msk       (0x7UL << ADC_SMPR1_SMP10_Pos)             
#define ADC_SMPR1_SMP10           ADC_SMPR1_SMP10_Msk                        
#define ADC_SMPR1_SMP10_0         (0x1UL << ADC_SMPR1_SMP10_Pos)             
#define ADC_SMPR1_SMP10_1         (0x2UL << ADC_SMPR1_SMP10_Pos)             
#define ADC_SMPR1_SMP10_2         (0x4UL << ADC_SMPR1_SMP10_Pos)             
#define ADC_SMPR1_SMP11_Pos       (3U)                                       
#define ADC_SMPR1_SMP11_Msk       (0x7UL << ADC_SMPR1_SMP11_Pos)             
#define ADC_SMPR1_SMP11           ADC_SMPR1_SMP11_Msk                        
#define ADC_SMPR1_SMP11_0         (0x1UL << ADC_SMPR1_SMP11_Pos)             
#define ADC_SMPR1_SMP11_1         (0x2UL << ADC_SMPR1_SMP11_Pos)             
#define ADC_SMPR1_SMP11_2         (0x4UL << ADC_SMPR1_SMP11_Pos)             
#define ADC_SMPR1_SMP12_Pos       (6U)                                       
#define ADC_SMPR1_SMP12_Msk       (0x7UL << ADC_SMPR1_SMP12_Pos)             
#define ADC_SMPR1_SMP12           ADC_SMPR1_SMP12_Msk                        
#define ADC_SMPR1_SMP12_0         (0x1UL << ADC_SMPR1_SMP12_Pos)             
#define ADC_SMPR1_SMP12_1         (0x2UL << ADC_SMPR1_SMP12_Pos)             
#define ADC_SMPR1_SMP12_2         (0x4UL << ADC_SMPR1_SMP12_Pos)             
#define ADC_SMPR1_SMP13_Pos       (9U)                                       
#define ADC_SMPR1_SMP13_Msk       (0x7UL << ADC_SMPR1_SMP13_Pos)             
#define ADC_SMPR1_SMP13           ADC_SMPR1_SMP13_Msk                        
#define ADC_SMPR1_SMP13_0         (0x1UL << ADC_SMPR1_SMP13_Pos)             
#define ADC_SMPR1_SMP13_1         (0x2UL << ADC_SMPR1_SMP13_Pos)             
#define ADC_SMPR1_SMP13_2         (0x4UL << ADC_SMPR1_SMP13_Pos)             
#define ADC_SMPR1_SMP14_Pos       (12U)                                      
#define ADC_SMPR1_SMP14_Msk       (0x7UL << ADC_SMPR1_SMP14_Pos)             
#define ADC_SMPR1_SMP14           ADC_SMPR1_SMP14_Msk                        
#define ADC_SMPR1_SMP14_0         (0x1UL << ADC_SMPR1_SMP14_Pos)             
#define ADC_SMPR1_SMP14_1         (0x2UL << ADC_SMPR1_SMP14_Pos)             
#define ADC_SMPR1_SMP14_2         (0x4UL << ADC_SMPR1_SMP14_Pos)             
#define ADC_SMPR1_SMP15_Pos       (15U)                                      
#define ADC_SMPR1_SMP15_Msk       (0x7UL << ADC_SMPR1_SMP15_Pos)             
#define ADC_SMPR1_SMP15           ADC_SMPR1_SMP15_Msk                        
#define ADC_SMPR1_SMP15_0         (0x1UL << ADC_SMPR1_SMP15_Pos)             
#define ADC_SMPR1_SMP15_1         (0x2UL << ADC_SMPR1_SMP15_Pos)             
#define ADC_SMPR1_SMP15_2         (0x4UL << ADC_SMPR1_SMP15_Pos)             
#define ADC_SMPR1_SMP16_Pos       (18U)                                      
#define ADC_SMPR1_SMP16_Msk       (0x7UL << ADC_SMPR1_SMP16_Pos)             
#define ADC_SMPR1_SMP16           ADC_SMPR1_SMP16_Msk                        
#define ADC_SMPR1_SMP16_0         (0x1UL << ADC_SMPR1_SMP16_Pos)             
#define ADC_SMPR1_SMP16_1         (0x2UL << ADC_SMPR1_SMP16_Pos)             
#define ADC_SMPR1_SMP16_2         (0x4UL << ADC_SMPR1_SMP16_Pos)             
#define ADC_SMPR1_SMP17_Pos       (21U)                                      
#define ADC_SMPR1_SMP17_Msk       (0x7UL << ADC_SMPR1_SMP17_Pos)              
#define ADC_SMPR1_SMP17           ADC_SMPR1_SMP17_Msk                         
#define ADC_SMPR1_SMP17_0         (0x1UL << ADC_SMPR1_SMP17_Pos)              
#define ADC_SMPR1_SMP17_1         (0x2UL << ADC_SMPR1_SMP17_Pos)              
#define ADC_SMPR1_SMP17_2         (0x4UL << ADC_SMPR1_SMP17_Pos)              
#define ADC_SMPR1_SMP18_Pos       (24U)                                       
#define ADC_SMPR1_SMP18_Msk       (0x7UL << ADC_SMPR1_SMP18_Pos)              
#define ADC_SMPR1_SMP18           ADC_SMPR1_SMP18_Msk                         
#define ADC_SMPR1_SMP18_0         (0x1UL << ADC_SMPR1_SMP18_Pos)              
#define ADC_SMPR1_SMP18_1         (0x2UL << ADC_SMPR1_SMP18_Pos)              
#define ADC_SMPR1_SMP18_2         (0x4UL << ADC_SMPR1_SMP18_Pos)              

