sownlee/MCAL/env/STM32F407VG/header/Header_ADC.h
/******************  Bit definition for ADC_SMPR2 register  *******************/
#define ADC_SMPR2_SMP0_Pos        (0U)                                         
#define ADC_SMPR2_SMP0_Msk        (0x7UL << ADC_SMPR2_SMP0_Pos)             
#define ADC_SMPR2_SMP0            ADC_SMPR2_SMP0_Msk                        
#define ADC_SMPR2_SMP0_0          (0x1UL << ADC_SMPR2_SMP0_Pos)             
#define ADC_SMPR2_SMP0_1          (0x2UL << ADC_SMPR2_SMP0_Pos)             
#define ADC_SMPR2_SMP0_2          (0x4UL << ADC_SMPR2_SMP0_Pos)             
#define ADC_SMPR2_SMP1_Pos        (3U)                                      
#define ADC_SMPR2_SMP1_Msk        (0x7UL << ADC_SMPR2_SMP1_Pos)             
#define ADC_SMPR2_SMP1            ADC_SMPR2_SMP1_Msk                        
#define ADC_SMPR2_SMP1_0          (0x1UL << ADC_SMPR2_SMP1_Pos)             
#define ADC_SMPR2_SMP1_1          (0x2UL << ADC_SMPR2_SMP1_Pos)             
#define ADC_SMPR2_SMP1_2          (0x4UL << ADC_SMPR2_SMP1_Pos)             
#define ADC_SMPR2_SMP2_Pos        (6U)                                      
#define ADC_SMPR2_SMP2_Msk        (0x7UL << ADC_SMPR2_SMP2_Pos)             
#define ADC_SMPR2_SMP2            ADC_SMPR2_SMP2_Msk                        
#define ADC_SMPR2_SMP2_0          (0x1UL << ADC_SMPR2_SMP2_Pos)             
#define ADC_SMPR2_SMP2_1          (0x2UL << ADC_SMPR2_SMP2_Pos)             
#define ADC_SMPR2_SMP2_2          (0x4UL << ADC_SMPR2_SMP2_Pos)             
#define ADC_SMPR2_SMP3_Pos        (9U)                                      
#define ADC_SMPR2_SMP3_Msk        (0x7UL << ADC_SMPR2_SMP3_Pos)             
#define ADC_SMPR2_SMP3            ADC_SMPR2_SMP3_Msk                        
#define ADC_SMPR2_SMP3_0          (0x1UL << ADC_SMPR2_SMP3_Pos)             
#define ADC_SMPR2_SMP3_1          (0x2UL << ADC_SMPR2_SMP3_Pos)             
#define ADC_SMPR2_SMP3_2          (0x4UL << ADC_SMPR2_SMP3_Pos)             
#define ADC_SMPR2_SMP4_Pos        (12U)                                     
#define ADC_SMPR2_SMP4_Msk        (0x7UL << ADC_SMPR2_SMP4_Pos)             
#define ADC_SMPR2_SMP4            ADC_SMPR2_SMP4_Msk                        
#define ADC_SMPR2_SMP4_0          (0x1UL << ADC_SMPR2_SMP4_Pos)             
#define ADC_SMPR2_SMP4_1          (0x2UL << ADC_SMPR2_SMP4_Pos)             
#define ADC_SMPR2_SMP4_2          (0x4UL << ADC_SMPR2_SMP4_Pos)             
#define ADC_SMPR2_SMP5_Pos        (15U)                                     
#define ADC_SMPR2_SMP5_Msk        (0x7UL << ADC_SMPR2_SMP5_Pos)             
#define ADC_SMPR2_SMP5            ADC_SMPR2_SMP5_Msk                        
#define ADC_SMPR2_SMP5_0          (0x1UL << ADC_SMPR2_SMP5_Pos)             
#define ADC_SMPR2_SMP5_1          (0x2UL << ADC_SMPR2_SMP5_Pos)             
#define ADC_SMPR2_SMP5_2          (0x4UL << ADC_SMPR2_SMP5_Pos)             
#define ADC_SMPR2_SMP6_Pos        (18U)                                     
#define ADC_SMPR2_SMP6_Msk        (0x7UL << ADC_SMPR2_SMP6_Pos)             
#define ADC_SMPR2_SMP6            ADC_SMPR2_SMP6_Msk                        
#define ADC_SMPR2_SMP6_0          (0x1UL << ADC_SMPR2_SMP6_Pos)             
#define ADC_SMPR2_SMP6_1          (0x2UL << ADC_SMPR2_SMP6_Pos)             
#define ADC_SMPR2_SMP6_2          (0x4UL << ADC_SMPR2_SMP6_Pos)             
#define ADC_SMPR2_SMP7_Pos        (21U)                                     
#define ADC_SMPR2_SMP7_Msk        (0x7UL << ADC_SMPR2_SMP7_Pos)             
#define ADC_SMPR2_SMP7            ADC_SMPR2_SMP7_Msk                        
#define ADC_SMPR2_SMP7_0          (0x1UL << ADC_SMPR2_SMP7_Pos)             
#define ADC_SMPR2_SMP7_1          (0x2UL << ADC_SMPR2_SMP7_Pos)             
#define ADC_SMPR2_SMP7_2          (0x4UL << ADC_SMPR2_SMP7_Pos)             
#define ADC_SMPR2_SMP8_Pos        (24U)                                     
#define ADC_SMPR2_SMP8_Msk        (0x7UL << ADC_SMPR2_SMP8_Pos)             
#define ADC_SMPR2_SMP8            ADC_SMPR2_SMP8_Msk                        
#define ADC_SMPR2_SMP8_0          (0x1UL << ADC_SMPR2_SMP8_Pos)             
#define ADC_SMPR2_SMP8_1          (0x2UL << ADC_SMPR2_SMP8_Pos)             
#define ADC_SMPR2_SMP8_2          (0x4UL << ADC_SMPR2_SMP8_Pos)             
#define ADC_SMPR2_SMP9_Pos        (27U)                                     
#define ADC_SMPR2_SMP9_Msk        (0x7UL << ADC_SMPR2_SMP9_Pos)             
#define ADC_SMPR2_SMP9            ADC_SMPR2_SMP9_Msk                        
#define ADC_SMPR2_SMP9_0          (0x1UL << ADC_SMPR2_SMP9_Pos)             
#define ADC_SMPR2_SMP9_1          (0x2UL << ADC_SMPR2_SMP9_Pos)             
#define ADC_SMPR2_SMP9_2          (0x4UL << ADC_SMPR2_SMP9_Pos)             

/******************  Bit definition for ADC_JOFR1 register  *******************/
#define ADC_JOFR1_JOFFSET1_Pos    (0U)                                         
#define ADC_JOFR1_JOFFSET1_Msk    (0xFFFUL << ADC_JOFR1_JOFFSET1_Pos)          
#define ADC_JOFR1_JOFFSET1        ADC_JOFR1_JOFFSET1_Msk                       

/******************  Bit definition for ADC_JOFR2 register  *******************/
#define ADC_JOFR2_JOFFSET2_Pos    (0U)                                         
#define ADC_JOFR2_JOFFSET2_Msk    (0xFFFUL << ADC_JOFR2_JOFFSET2_Pos)           
#define ADC_JOFR2_JOFFSET2        ADC_JOFR2_JOFFSET2_Msk                       /

/******************  Bit definition for ADC_JOFR3 register  *******************/
#define ADC_JOFR3_JOFFSET3_Pos    (0U)                                         
#define ADC_JOFR3_JOFFSET3_Msk    (0xFFFUL << ADC_JOFR3_JOFFSET3_Pos)          
#define ADC_JOFR3_JOFFSET3        ADC_JOFR3_JOFFSET3_Msk                       

/******************  Bit definition for ADC_JOFR4 register  *******************/
#define ADC_JOFR4_JOFFSET4_Pos    (0U)                                         
#define ADC_JOFR4_JOFFSET4_Msk    (0xFFFUL << ADC_JOFR4_JOFFSET4_Pos)         
#define ADC_JOFR4_JOFFSET4        ADC_JOFR4_JOFFSET4_Msk                      

/*******************  Bit definition for ADC_HTR register  ********************/
#define ADC_HTR_HT_Pos            (0U)                                         
#define ADC_HTR_HT_Msk            (0xFFFUL << ADC_HTR_HT_Pos)                  
#define ADC_HTR_HT                ADC_HTR_HT_Msk                               

/*******************  Bit definition for ADC_LTR register  ********************/
#define ADC_LTR_LT_Pos            (0U)                                        
#define ADC_LTR_LT_Msk            (0xFFFUL << ADC_LTR_LT_Pos)                  
#define ADC_LTR_LT                ADC_LTR_LT_Msk                               

/*******************  Bit definition for ADC_SQR1 register  *******************/
#define ADC_SQR1_SQ13_Pos         (0U)                                         
#define ADC_SQR1_SQ13_Msk         (0x1FUL << ADC_SQR1_SQ13_Pos)                 
#define ADC_SQR1_SQ13             ADC_SQR1_SQ13_Msk                           
#define ADC_SQR1_SQ13_0           (0x01UL << ADC_SQR1_SQ13_Pos)               
#define ADC_SQR1_SQ13_1           (0x02UL << ADC_SQR1_SQ13_Pos)                 
#define ADC_SQR1_SQ13_2           (0x04UL << ADC_SQR1_SQ13_Pos)                 
#define ADC_SQR1_SQ13_3           (0x08UL << ADC_SQR1_SQ13_Pos)                 
#define ADC_SQR1_SQ13_4           (0x10UL << ADC_SQR1_SQ13_Pos)                 
#define ADC_SQR1_SQ14_Pos         (5U)                                      
#define ADC_SQR1_SQ14_Msk         (0x1FUL << ADC_SQR1_SQ14_Pos)             
#define ADC_SQR1_SQ14             ADC_SQR1_SQ14_Msk                         
#define ADC_SQR1_SQ14_0           (0x01UL << ADC_SQR1_SQ14_Pos)             
#define ADC_SQR1_SQ14_1           (0x02UL << ADC_SQR1_SQ14_Pos)             
#define ADC_SQR1_SQ14_2           (0x04UL << ADC_SQR1_SQ14_Pos)             
#define ADC_SQR1_SQ14_3           (0x08UL << ADC_SQR1_SQ14_Pos)             
#define ADC_SQR1_SQ14_4           (0x10UL << ADC_SQR1_SQ14_Pos)             
#define ADC_SQR1_SQ15_Pos         (10U)                                     
#define ADC_SQR1_SQ15_Msk         (0x1FUL << ADC_SQR1_SQ15_Pos)             
#define ADC_SQR1_SQ15             ADC_SQR1_SQ15_Msk                         
#define ADC_SQR1_SQ15_0           (0x01UL << ADC_SQR1_SQ15_Pos)             
#define ADC_SQR1_SQ15_1           (0x02UL << ADC_SQR1_SQ15_Pos)             
#define ADC_SQR1_SQ15_2           (0x04UL << ADC_SQR1_SQ15_Pos)             
#define ADC_SQR1_SQ15_3           (0x08UL << ADC_SQR1_SQ15_Pos)             
#define ADC_SQR1_SQ15_4           (0x10UL << ADC_SQR1_SQ15_Pos)             
#define ADC_SQR1_SQ16_Pos         (15U)                                     
#define ADC_SQR1_SQ16_Msk         (0x1FUL << ADC_SQR1_SQ16_Pos)             
#define ADC_SQR1_SQ16             ADC_SQR1_SQ16_Msk                         
#define ADC_SQR1_SQ16_0           (0x01UL << ADC_SQR1_SQ16_Pos)             
#define ADC_SQR1_SQ16_1           (0x02UL << ADC_SQR1_SQ16_Pos)             
#define ADC_SQR1_SQ16_2           (0x04UL << ADC_SQR1_SQ16_Pos)             
#define ADC_SQR1_SQ16_3           (0x08UL << ADC_SQR1_SQ16_Pos)             
#define ADC_SQR1_SQ16_4           (0x10UL << ADC_SQR1_SQ16_Pos)             
#define ADC_SQR1_L_Pos            (20U)                                     
#define ADC_SQR1_L_Msk            (0xFUL << ADC_SQR1_L_Pos)                 
#define ADC_SQR1_L                ADC_SQR1_L_Msk                            
#define ADC_SQR1_L_0              (0x1UL << ADC_SQR1_L_Pos)                 
#define ADC_SQR1_L_1              (0x2UL << ADC_SQR1_L_Pos)                 
#define ADC_SQR1_L_2              (0x4UL << ADC_SQR1_L_Pos)                 
#define ADC_SQR1_L_3              (0x8UL << ADC_SQR1_L_Pos)                 

/*******************  Bit definition for ADC_SQR2 register  *******************/
#define ADC_SQR2_SQ7_Pos          (0U)                                         
#define ADC_SQR2_SQ7_Msk          (0x1FUL << ADC_SQR2_SQ7_Pos)                  
#define ADC_SQR2_SQ7              ADC_SQR2_SQ7_Msk                          
#define ADC_SQR2_SQ7_0            (0x01UL << ADC_SQR2_SQ7_Pos)              
#define ADC_SQR2_SQ7_1            (0x02UL << ADC_SQR2_SQ7_Pos)              
#define ADC_SQR2_SQ7_2            (0x04UL << ADC_SQR2_SQ7_Pos)              
#define ADC_SQR2_SQ7_3            (0x08UL << ADC_SQR2_SQ7_Pos)              
#define ADC_SQR2_SQ7_4            (0x10UL << ADC_SQR2_SQ7_Pos)              
#define ADC_SQR2_SQ8_Pos          (5U)                                      
#define ADC_SQR2_SQ8_Msk          (0x1FUL << ADC_SQR2_SQ8_Pos)              
#define ADC_SQR2_SQ8              ADC_SQR2_SQ8_Msk                          
#define ADC_SQR2_SQ8_0            (0x01UL << ADC_SQR2_SQ8_Pos)              
#define ADC_SQR2_SQ8_1            (0x02UL << ADC_SQR2_SQ8_Pos)              
#define ADC_SQR2_SQ8_2            (0x04UL << ADC_SQR2_SQ8_Pos)              
#define ADC_SQR2_SQ8_3            (0x08UL << ADC_SQR2_SQ8_Pos)              
#define ADC_SQR2_SQ8_4            (0x10UL << ADC_SQR2_SQ8_Pos)              
#define ADC_SQR2_SQ9_Pos          (10U)                                     
#define ADC_SQR2_SQ9_Msk          (0x1FUL << ADC_SQR2_SQ9_Pos)              
#define ADC_SQR2_SQ9              ADC_SQR2_SQ9_Msk                          
#define ADC_SQR2_SQ9_0            (0x01UL << ADC_SQR2_SQ9_Pos)              
#define ADC_SQR2_SQ9_1            (0x02UL << ADC_SQR2_SQ9_Pos)              
#define ADC_SQR2_SQ9_2            (0x04UL << ADC_SQR2_SQ9_Pos)              
#define ADC_SQR2_SQ9_3            (0x08UL << ADC_SQR2_SQ9_Pos)              
#define ADC_SQR2_SQ9_4            (0x10UL << ADC_SQR2_SQ9_Pos)              
#define ADC_SQR2_SQ10_Pos         (15U)                                     
#define ADC_SQR2_SQ10_Msk         (0x1FUL << ADC_SQR2_SQ10_Pos)             
#define ADC_SQR2_SQ10             ADC_SQR2_SQ10_Msk                         
#define ADC_SQR2_SQ10_0           (0x01UL << ADC_SQR2_SQ10_Pos)             
#define ADC_SQR2_SQ10_1           (0x02UL << ADC_SQR2_SQ10_Pos)             
#define ADC_SQR2_SQ10_2           (0x04UL << ADC_SQR2_SQ10_Pos)             
#define ADC_SQR2_SQ10_3           (0x08UL << ADC_SQR2_SQ10_Pos)             
#define ADC_SQR2_SQ10_4           (0x10UL << ADC_SQR2_SQ10_Pos)             
#define ADC_SQR2_SQ11_Pos         (20U)                                     
#define ADC_SQR2_SQ11_Msk         (0x1FUL << ADC_SQR2_SQ11_Pos)             
#define ADC_SQR2_SQ11             ADC_SQR2_SQ11_Msk                         
#define ADC_SQR2_SQ11_0           (0x01UL << ADC_SQR2_SQ11_Pos)             
#define ADC_SQR2_SQ11_1           (0x02UL << ADC_SQR2_SQ11_Pos)             
#define ADC_SQR2_SQ11_2           (0x04UL << ADC_SQR2_SQ11_Pos)              
#define ADC_SQR2_SQ11_3           (0x08UL << ADC_SQR2_SQ11_Pos)              
#define ADC_SQR2_SQ11_4           (0x10UL << ADC_SQR2_SQ11_Pos)              
#define ADC_SQR2_SQ12_Pos         (25U)                                      
#define ADC_SQR2_SQ12_Msk         (0x1FUL << ADC_SQR2_SQ12_Pos)              
#define ADC_SQR2_SQ12             ADC_SQR2_SQ12_Msk                          
#define ADC_SQR2_SQ12_0           (0x01UL << ADC_SQR2_SQ12_Pos)              
#define ADC_SQR2_SQ12_1           (0x02UL << ADC_SQR2_SQ12_Pos)              
#define ADC_SQR2_SQ12_2           (0x04UL << ADC_SQR2_SQ12_Pos)              
#define ADC_SQR2_SQ12_3           (0x08UL << ADC_SQR2_SQ12_Pos)              
#define ADC_SQR2_SQ12_4           (0x10UL << ADC_SQR2_SQ12_Pos)              

