sownlee/MCAL/env/STM32F407VG/header/Header_ADC.h
/*******************  Bit definition for ADC_SQR3 register  *******************/
#define ADC_SQR3_SQ1_Pos          (0U)                                         
#define ADC_SQR3_SQ1_Msk          (0x1FUL << ADC_SQR3_SQ1_Pos)            
#define ADC_SQR3_SQ1              ADC_SQR3_SQ1_Msk                        
#define ADC_SQR3_SQ1_0            (0x01UL << ADC_SQR3_SQ1_Pos)            
#define ADC_SQR3_SQ1_1            (0x02UL << ADC_SQR3_SQ1_Pos)            
#define ADC_SQR3_SQ1_2            (0x04UL << ADC_SQR3_SQ1_Pos)            
#define ADC_SQR3_SQ1_3            (0x08UL << ADC_SQR3_SQ1_Pos)            
#define ADC_SQR3_SQ1_4            (0x10UL << ADC_SQR3_SQ1_Pos)            
#define ADC_SQR3_SQ2_Pos          (5U)                                    
#define ADC_SQR3_SQ2_Msk          (0x1FUL << ADC_SQR3_SQ2_Pos)            
#define ADC_SQR3_SQ2              ADC_SQR3_SQ2_Msk                        
#define ADC_SQR3_SQ2_0            (0x01UL << ADC_SQR3_SQ2_Pos)            
#define ADC_SQR3_SQ2_1            (0x02UL << ADC_SQR3_SQ2_Pos)            
#define ADC_SQR3_SQ2_2            (0x04UL << ADC_SQR3_SQ2_Pos)            
#define ADC_SQR3_SQ2_3            (0x08UL << ADC_SQR3_SQ2_Pos)            
#define ADC_SQR3_SQ2_4            (0x10UL << ADC_SQR3_SQ2_Pos)            
#define ADC_SQR3_SQ3_Pos          (10U)                                   
#define ADC_SQR3_SQ3_Msk          (0x1FUL << ADC_SQR3_SQ3_Pos)            
#define ADC_SQR3_SQ3              ADC_SQR3_SQ3_Msk                        
#define ADC_SQR3_SQ3_0            (0x01UL << ADC_SQR3_SQ3_Pos)            
#define ADC_SQR3_SQ3_1            (0x02UL << ADC_SQR3_SQ3_Pos)            
#define ADC_SQR3_SQ3_2            (0x04UL << ADC_SQR3_SQ3_Pos)            
#define ADC_SQR3_SQ3_3            (0x08UL << ADC_SQR3_SQ3_Pos)            
#define ADC_SQR3_SQ3_4            (0x10UL << ADC_SQR3_SQ3_Pos)            
#define ADC_SQR3_SQ4_Pos          (15U)                                   
#define ADC_SQR3_SQ4_Msk          (0x1FUL << ADC_SQR3_SQ4_Pos)            
#define ADC_SQR3_SQ4              ADC_SQR3_SQ4_Msk                        
#define ADC_SQR3_SQ4_0            (0x01UL << ADC_SQR3_SQ4_Pos)           
#define ADC_SQR3_SQ4_1            (0x02UL << ADC_SQR3_SQ4_Pos)           
#define ADC_SQR3_SQ4_2            (0x04UL << ADC_SQR3_SQ4_Pos)           
#define ADC_SQR3_SQ4_3            (0x08UL << ADC_SQR3_SQ4_Pos)           
#define ADC_SQR3_SQ4_4            (0x10UL << ADC_SQR3_SQ4_Pos)            
#define ADC_SQR3_SQ5_Pos          (20U)                                   
#define ADC_SQR3_SQ5_Msk          (0x1FUL << ADC_SQR3_SQ5_Pos)            
#define ADC_SQR3_SQ5              ADC_SQR3_SQ5_Msk                        
#define ADC_SQR3_SQ5_0            (0x01UL << ADC_SQR3_SQ5_Pos)            
#define ADC_SQR3_SQ5_1            (0x02UL << ADC_SQR3_SQ5_Pos)            
#define ADC_SQR3_SQ5_2            (0x04UL << ADC_SQR3_SQ5_Pos)            
#define ADC_SQR3_SQ5_3            (0x08UL << ADC_SQR3_SQ5_Pos)            
#define ADC_SQR3_SQ5_4            (0x10UL << ADC_SQR3_SQ5_Pos)            
#define ADC_SQR3_SQ6_Pos          (25U)                                   
#define ADC_SQR3_SQ6_Msk          (0x1FUL << ADC_SQR3_SQ6_Pos)            
#define ADC_SQR3_SQ6              ADC_SQR3_SQ6_Msk                        
#define ADC_SQR3_SQ6_0            (0x01UL << ADC_SQR3_SQ6_Pos)            
#define ADC_SQR3_SQ6_1            (0x02UL << ADC_SQR3_SQ6_Pos)            
#define ADC_SQR3_SQ6_2            (0x04UL << ADC_SQR3_SQ6_Pos)            
#define ADC_SQR3_SQ6_3            (0x08UL << ADC_SQR3_SQ6_Pos)            
#define ADC_SQR3_SQ6_4            (0x10UL << ADC_SQR3_SQ6_Pos)            

/*******************  Bit definition for ADC_JSQR register  *******************/
#define ADC_JSQR_JSQ1_Pos         (0U)                                         
#define ADC_JSQR_JSQ1_Msk         (0x1FUL << ADC_JSQR_JSQ1_Pos)           
#define ADC_JSQR_JSQ1             ADC_JSQR_JSQ1_Msk                       
#define ADC_JSQR_JSQ1_0           (0x01UL << ADC_JSQR_JSQ1_Pos)           
#define ADC_JSQR_JSQ1_1           (0x02UL << ADC_JSQR_JSQ1_Pos)           
#define ADC_JSQR_JSQ1_2           (0x04UL << ADC_JSQR_JSQ1_Pos)           
#define ADC_JSQR_JSQ1_3           (0x08UL << ADC_JSQR_JSQ1_Pos)           
#define ADC_JSQR_JSQ1_4           (0x10UL << ADC_JSQR_JSQ1_Pos)           
#define ADC_JSQR_JSQ2_Pos         (5U)                                    
#define ADC_JSQR_JSQ2_Msk         (0x1FUL << ADC_JSQR_JSQ2_Pos)           
#define ADC_JSQR_JSQ2             ADC_JSQR_JSQ2_Msk                       
#define ADC_JSQR_JSQ2_0           (0x01UL << ADC_JSQR_JSQ2_Pos)           
#define ADC_JSQR_JSQ2_1           (0x02UL << ADC_JSQR_JSQ2_Pos)           
#define ADC_JSQR_JSQ2_2           (0x04UL << ADC_JSQR_JSQ2_Pos)           
#define ADC_JSQR_JSQ2_3           (0x08UL << ADC_JSQR_JSQ2_Pos)           
#define ADC_JSQR_JSQ2_4           (0x10UL << ADC_JSQR_JSQ2_Pos)           
#define ADC_JSQR_JSQ3_Pos         (10U)                                   
#define ADC_JSQR_JSQ3_Msk         (0x1FUL << ADC_JSQR_JSQ3_Pos)           
#define ADC_JSQR_JSQ3             ADC_JSQR_JSQ3_Msk                       
#define ADC_JSQR_JSQ3_0           (0x01UL << ADC_JSQR_JSQ3_Pos)           
#define ADC_JSQR_JSQ3_1           (0x02UL << ADC_JSQR_JSQ3_Pos)           
#define ADC_JSQR_JSQ3_2           (0x04UL << ADC_JSQR_JSQ3_Pos)           
#define ADC_JSQR_JSQ3_3           (0x08UL << ADC_JSQR_JSQ3_Pos)           
#define ADC_JSQR_JSQ3_4           (0x10UL << ADC_JSQR_JSQ3_Pos)           
#define ADC_JSQR_JSQ4_Pos         (15U)                                   
#define ADC_JSQR_JSQ4_Msk         (0x1FUL << ADC_JSQR_JSQ4_Pos)           
#define ADC_JSQR_JSQ4             ADC_JSQR_JSQ4_Msk                       
#define ADC_JSQR_JSQ4_0           (0x01UL << ADC_JSQR_JSQ4_Pos)           
#define ADC_JSQR_JSQ4_1           (0x02UL << ADC_JSQR_JSQ4_Pos)           
#define ADC_JSQR_JSQ4_2           (0x04UL << ADC_JSQR_JSQ4_Pos)           
#define ADC_JSQR_JSQ4_3           (0x08UL << ADC_JSQR_JSQ4_Pos)           
#define ADC_JSQR_JSQ4_4           (0x10UL << ADC_JSQR_JSQ4_Pos)           
#define ADC_JSQR_JL_Pos           (20U)                                   
#define ADC_JSQR_JL_Msk           (0x3UL << ADC_JSQR_JL_Pos)              
#define ADC_JSQR_JL               ADC_JSQR_JL_Msk                         
#define ADC_JSQR_JL_0             (0x1UL << ADC_JSQR_JL_Pos)              
#define ADC_JSQR_JL_1             (0x2UL << ADC_JSQR_JL_Pos)              

/*******************  Bit definition for ADC_JDR1 register  *******************/
#define ADC_JDR1_JDATA_Pos        (0U)                                        
#define ADC_JDR1_JDATA_Msk        (0xFFFFUL << ADC_JDR1_JDATA_Pos)            
#define ADC_JDR1_JDATA            ADC_JDR1_JDATA_Msk                          

/*******************  Bit definition for ADC_JDR2 register  *******************/
#define ADC_JDR2_JDATA_Pos        (0U)                                      
#define ADC_JDR2_JDATA_Msk        (0xFFFFUL << ADC_JDR2_JDATA_Pos)          
#define ADC_JDR2_JDATA            ADC_JDR2_JDATA_Msk                        

/*******************  Bit definition for ADC_JDR3 register  *******************/
#define ADC_JDR3_JDATA_Pos        (0U)                                        
#define ADC_JDR3_JDATA_Msk        (0xFFFFUL << ADC_JDR3_JDATA_Pos)            
#define ADC_JDR3_JDATA            ADC_JDR3_JDATA_Msk                          

/*******************  Bit definition for ADC_JDR4 register  *******************/
#define ADC_JDR4_JDATA_Pos        (0U)                                       
#define ADC_JDR4_JDATA_Msk        (0xFFFFUL << ADC_JDR4_JDATA_Pos)           
#define ADC_JDR4_JDATA            ADC_JDR4_JDATA_Msk                         

