sownlee/MCAL/env/STM32F407VG/header/Header_ADC.h
/********************  Bit definition for ADC_DR register  ********************/
#define ADC_DR_DATA_Pos           (0U)                                     
#define ADC_DR_DATA_Msk           (0xFFFFUL << ADC_DR_DATA_Pos)            
#define ADC_DR_DATA               ADC_DR_DATA_Msk                          
#define ADC_DR_ADC2DATA_Pos       (16U)                                    
#define ADC_DR_ADC2DATA_Msk       (0xFFFFUL << ADC_DR_ADC2DATA_Pos)        
#define ADC_DR_ADC2DATA           ADC_DR_ADC2DATA_Msk                      

/*******************  Bit definition for ADC_CSR register  ********************/
#define ADC_CSR_AWD1_Pos          (0U)                                         
#define ADC_CSR_AWD1_Msk          (0x1UL << ADC_CSR_AWD1_Pos)             
#define ADC_CSR_AWD1              ADC_CSR_AWD1_Msk                        
#define ADC_CSR_EOC1_Pos          (1U)                                    
#define ADC_CSR_EOC1_Msk          (0x1UL << ADC_CSR_EOC1_Pos)             
#define ADC_CSR_EOC1              ADC_CSR_EOC1_Msk                        
#define ADC_CSR_JEOC1_Pos         (2U)                                    
#define ADC_CSR_JEOC1_Msk         (0x1UL << ADC_CSR_JEOC1_Pos)            
#define ADC_CSR_JEOC1             ADC_CSR_JEOC1_Msk                       
#define ADC_CSR_JSTRT1_Pos        (3U)                                    
#define ADC_CSR_JSTRT1_Msk        (0x1UL << ADC_CSR_JSTRT1_Pos)           
#define ADC_CSR_JSTRT1            ADC_CSR_JSTRT1_Msk                      
#define ADC_CSR_STRT1_Pos         (4U)                                    
#define ADC_CSR_STRT1_Msk         (0x1UL << ADC_CSR_STRT1_Pos)            
#define ADC_CSR_STRT1             ADC_CSR_STRT1_Msk                       
#define ADC_CSR_OVR1_Pos          (5U)                                    
#define ADC_CSR_OVR1_Msk          (0x1UL << ADC_CSR_OVR1_Pos)             
#define ADC_CSR_OVR1              ADC_CSR_OVR1_Msk                        
#define ADC_CSR_AWD2_Pos          (8U)                                    
#define ADC_CSR_AWD2_Msk          (0x1UL << ADC_CSR_AWD2_Pos)             
#define ADC_CSR_AWD2              ADC_CSR_AWD2_Msk                        
#define ADC_CSR_EOC2_Pos          (9U)                                    
#define ADC_CSR_EOC2_Msk          (0x1UL << ADC_CSR_EOC2_Pos)             
#define ADC_CSR_EOC2              ADC_CSR_EOC2_Msk                        
#define ADC_CSR_JEOC2_Pos         (10U)                                   
#define ADC_CSR_JEOC2_Msk         (0x1UL << ADC_CSR_JEOC2_Pos)            
#define ADC_CSR_JEOC2             ADC_CSR_JEOC2_Msk                       
#define ADC_CSR_JSTRT2_Pos        (11U)                                   
#define ADC_CSR_JSTRT2_Msk        (0x1UL << ADC_CSR_JSTRT2_Pos)           
#define ADC_CSR_JSTRT2            ADC_CSR_JSTRT2_Msk                      
#define ADC_CSR_STRT2_Pos         (12U)                                   
#define ADC_CSR_STRT2_Msk         (0x1UL << ADC_CSR_STRT2_Pos)            
#define ADC_CSR_STRT2             ADC_CSR_STRT2_Msk                       
#define ADC_CSR_OVR2_Pos          (13U)                                   
#define ADC_CSR_OVR2_Msk          (0x1UL << ADC_CSR_OVR2_Pos)             
#define ADC_CSR_OVR2              ADC_CSR_OVR2_Msk                        
#define ADC_CSR_AWD3_Pos          (16U)                                   
#define ADC_CSR_AWD3_Msk          (0x1UL << ADC_CSR_AWD3_Pos)            
#define ADC_CSR_AWD3              ADC_CSR_AWD3_Msk                       
#define ADC_CSR_EOC3_Pos          (17U)                                  
#define ADC_CSR_EOC3_Msk          (0x1UL << ADC_CSR_EOC3_Pos)            
#define ADC_CSR_EOC3              ADC_CSR_EOC3_Msk                        
#define ADC_CSR_JEOC3_Pos         (18U)                                   
#define ADC_CSR_JEOC3_Msk         (0x1UL << ADC_CSR_JEOC3_Pos)            
#define ADC_CSR_JEOC3             ADC_CSR_JEOC3_Msk                       
#define ADC_CSR_JSTRT3_Pos        (19U)                                   
#define ADC_CSR_JSTRT3_Msk        (0x1UL << ADC_CSR_JSTRT3_Pos)           
#define ADC_CSR_JSTRT3            ADC_CSR_JSTRT3_Msk                      
#define ADC_CSR_STRT3_Pos         (20U)                                   
#define ADC_CSR_STRT3_Msk         (0x1UL << ADC_CSR_STRT3_Pos)            
#define ADC_CSR_STRT3             ADC_CSR_STRT3_Msk                       
#define ADC_CSR_OVR3_Pos          (21U)                                   
#define ADC_CSR_OVR3_Msk          (0x1UL << ADC_CSR_OVR3_Pos)             
#define ADC_CSR_OVR3              ADC_CSR_OVR3_Msk                        

/* Legacy defines */
#define  ADC_CSR_DOVR1                        ADC_CSR_OVR1
#define  ADC_CSR_DOVR2                        ADC_CSR_OVR2
#define  ADC_CSR_DOVR3                        ADC_CSR_OVR3

/*******************  Bit definition for ADC_CCR register  ********************/
#define ADC_CCR_MULTI_Pos         (0U)                                         
#define ADC_CCR_MULTI_Msk         (0x1FUL << ADC_CCR_MULTI_Pos)             
#define ADC_CCR_MULTI             ADC_CCR_MULTI_Msk                         
#define ADC_CCR_MULTI_0           (0x01UL << ADC_CCR_MULTI_Pos)             
#define ADC_CCR_MULTI_1           (0x02UL << ADC_CCR_MULTI_Pos)             
#define ADC_CCR_MULTI_2           (0x04UL << ADC_CCR_MULTI_Pos)             
#define ADC_CCR_MULTI_3           (0x08UL << ADC_CCR_MULTI_Pos)             
#define ADC_CCR_MULTI_4           (0x10UL << ADC_CCR_MULTI_Pos)             
#define ADC_CCR_DELAY_Pos         (8U)                                      
#define ADC_CCR_DELAY_Msk         (0xFUL << ADC_CCR_DELAY_Pos)              
#define ADC_CCR_DELAY             ADC_CCR_DELAY_Msk                         
#define ADC_CCR_DELAY_0           (0x1UL << ADC_CCR_DELAY_Pos)              
#define ADC_CCR_DELAY_1           (0x2UL << ADC_CCR_DELAY_Pos)              
#define ADC_CCR_DELAY_2           (0x4UL << ADC_CCR_DELAY_Pos)              
#define ADC_CCR_DELAY_3           (0x8UL << ADC_CCR_DELAY_Pos)              
#define ADC_CCR_DDS_Pos           (13U)                                     
#define ADC_CCR_DDS_Msk           (0x1UL << ADC_CCR_DDS_Pos)                
#define ADC_CCR_DDS               ADC_CCR_DDS_Msk                           
#define ADC_CCR_DMA_Pos           (14U)                                     
#define ADC_CCR_DMA_Msk           (0x3UL << ADC_CCR_DMA_Pos)                
#define ADC_CCR_DMA               ADC_CCR_DMA_Msk                           
#define ADC_CCR_DMA_0             (0x1UL << ADC_CCR_DMA_Pos)                
#define ADC_CCR_DMA_1             (0x2UL << ADC_CCR_DMA_Pos)                
#define ADC_CCR_ADCPRE_Pos        (16U)                                     
#define ADC_CCR_ADCPRE_Msk        (0x3UL << ADC_CCR_ADCPRE_Pos)             
#define ADC_CCR_ADCPRE            ADC_CCR_ADCPRE_Msk                        
#define ADC_CCR_ADCPRE_0          (0x1UL << ADC_CCR_ADCPRE_Pos)             
#define ADC_CCR_ADCPRE_1          (0x2UL << ADC_CCR_ADCPRE_Pos)             
#define ADC_CCR_VBATE_Pos         (22U)                                     
#define ADC_CCR_VBATE_Msk         (0x1UL << ADC_CCR_VBATE_Pos)              
#define ADC_CCR_VBATE             ADC_CCR_VBATE_Msk                         
#define ADC_CCR_TSVREFE_Pos       (23U)                                     
#define ADC_CCR_TSVREFE_Msk       (0x1UL << ADC_CCR_TSVREFE_Pos)            
#define ADC_CCR_TSVREFE           ADC_CCR_TSVREFE_Msk                       

/*******************  Bit definition for ADC_CDR register  ********************/
#define ADC_CDR_DATA1_Pos         (0U)                                        
#define ADC_CDR_DATA1_Msk         (0xFFFFUL << ADC_CDR_DATA1_Pos)              
#define ADC_CDR_DATA1             ADC_CDR_DATA1_Msk                            
#define ADC_CDR_DATA2_Pos         (16U)                                       
#define ADC_CDR_DATA2_Msk         (0xFFFFUL << ADC_CDR_DATA2_Pos)              
#define ADC_CDR_DATA2             ADC_CDR_DATA2_Msk                            

/* Legacy defines */
#define ADC_CDR_RDATA_MST         ADC_CDR_DATA1
#define ADC_CDR_RDATA_SLV         ADC_CDR_DATA2

#endif  /* HEADER_ADC_H_ */
